package ITTalentsHomeWork1;

public class Questions {
    public static void main(String[] args) {
        //тук ще запиша въпросите си по задачите
        //задача 1 трябва ли да определяме всеки път кое от числата е по голямо
        //задача 2 има ли друг начин да се екскейпне "%" освен  String percent = "%";
        //задача 3 не е уточнено дали може да се ползват и други променливи
        //задача 5 има ли по лесен вариант на сортиране ??? без лист??
        //задача 10 не става ако не се използва някоя от кофите 2- пъти повече от друта  21 /106 и т.н.
        //задача 11 не се ли принтира нещо?

    }
}
