package ITTalentsHomeWork1;

public class test {
    public static void main(String[] args) {
         /*Задача 12: Високосни години са всички години кратни на 4 с
        изключения столетията, но без столетия кратни на 400, т.е. 1900
        не е високосна, но 1600 и 2000 са високосни.Съставете програма,
        която по дадени ден, месец и година, отпечатва следващата дата.
        – Входни данни: три числа за ден, месец, година.
        – Пример: 28, 2, 2021
        – Изход: 1,3,2021*/

        int year400 = 1600 % 400;//високосна
        int year100 = 1600 % 100;//невисокосна
        int year4 = 1600 % 4;//високосна
        if (year400 == 0 && year4 == 0 && (year100!=0)){

        }

        System.out.println(year400);
        System.out.println(year100);
        System.out.println(year4);
    }
}
