package ITTalentsHomework;

import java.util.Scanner;

public class Task15_Arrays {
    /*Задача 15: да се реши с отрицателни числа
    и да се направи с намиране на трите първи най големи и след това сравнение между тях !!!
    Да се състави програма, която въвежда в едномерен масив реални
    числа.
    Като изход: програма извежда онези 3 различни числа, чиято
    абсолютна стойност формира максималната обща сума.
    Пример: -7.13; 0.2; 4.9; 5.1; 6.34; 1.12
    // -7.13, 0.2, 4.9, 5.1, 6.34, 1.12
    Изход: 5.1; 6.34; 7.13*/
    public static void main(String[] args) {
        double[] array = {-7.13, 0.2, 4.9, 5.1, 6.34, 1.12};


    }
}
